#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
Модуль призначено для генерації коду за списком рядків програми.
Генератор коду повертає список команд.
Кожна команда - це кортеж: (<код_команди>, <операнд>)

У подальшому обчислення будуть виконуватись з використанням стеку.
Стек - це список, у який ми можемо додавати до кінця та брати з кінця числа.

Для виконання арифметичної операції буде братись
два останніх числа зі стеку,
обчислювати результат операції та додавати результат до стеку.
Тому генератор повинен згенерувати команди
завантаження змінних та констант до стеку
а також виконання арифметичних операцій та присвоєння.

Допустимі команди:
("LOADC", <число>) - завантажити число у стек
("LOADV", <змінна>) - завантажити значення змінної у стек
                      (використовується storage)
("ADD", None) - обчислити суму двох верхніх елементів стеку
("SUB", None) - обчислити різницю двох верхніх елементів стеку
("MUL", None) - обчислити добуток двох верхніх елементів стеку
("DIV", None) - обчислити частку від ділення двох верхніх елементів стеку
("SET", <змінна>) - встановити (присвоїти) значення змінної
                    у пам'яті (storage) рівним
                    значенню останнього елементу стеку

Генерація коду виконується за допомогою рекурсивного розбору виразу.
Вираз (expression) представляється як один доданок (term) або сума (різниця)
багатьох доданків.
Доданок (term) представляється як один множник (factor) або добуток
(частка від ділення) багатьох множників.
Множник (factor) представляється як константа або змінна,
або вираз (expression) у дужках.

Під час розбору кожна функція забирає токени зі списку токенів tokens,
а також додає команди до списку команд code
"""
import storage
from tokenizer import get_tokens
from syntax_analyzer import check_assignment_syntax

COMMANDS = ("LOADC",
            "LOADV",
            "ADD",
            "SUB",
            "MUL",
            "DIV",
            "SET")


def generate_code(program_lines):
    """
    Функція генерує код за списком рядків програми program_lines
    Повертає програмний код у вигляді списку кортежів
    (<код_команди>, <операнд>)
    Також, якщо під час генерації коду або аналізу виникає помилка,
    то повертає текст помилки. Якщо помилки немає, то повертає порожній рядок.
    Побічний ефект: очищує пам'ять.
    :param program_lines: список рядків програми
    :return: список команд - кортежів (<код_команди>, <операнд>)
    :return: текст помилки
    """
    res = []
    for line in program_lines:
        tmp = _generate_line_code(line)
        if tmp[1]:
            return tmp[1]
        res.append(tmp[0])
    return res


def _generate_line_code(program_line):
    """
    Функція генерує код за рядком програми program_line.
    Рядок програми має бути присвоэнням виду x = e,
    де x - змінна, e - вираз, або порожнім рядком.
    Використовує модулі tokenizer та syntax_analyzer для розбору
    та аналізу правильності синтаксису рядка програми.
    Використовує функцію _expression для генерації коду виразу, після чого
    генерує команду SET для змінної з лівої частини присвоєння, та додає
    змінну до пам'яті (storage), якщо потрібно.
    Якщо program_line - порожній рядок, то функція його ігнорує.
    Повертає програмний код для рядка програми у вигляді списку кортежів
    (<код_команди>, <операнд>)
    Також, якщо під час генерації коду або аналізу виникає помилка,
    то повертає текст помилки. Якщо помилки немає, то повертає порожній рядок.
    :param program_line: рядок програми
    :return: список команд - кортежів (<код_команди>, <операнд>)
    :return: текст помилки
    """
    tokens = get_tokens(program_line)
    succ, error = check_assignment_syntax(tokens)
    code = []
    if succ:
        code = []
        _expression(code, tokens[2:])
        code.append((COMMANDS[6], tokens[0].value))
    return code, error


def _expression(code, tokens):
    """
    Функція генерує код за списком токенів виразу.
    Використовує функцію _term для генерації коду доданку, після чого,
    поки список токенів не спорожніє і поточний токен - це операція
    '+' або '-', знову використовує _term для наступного доданку та
    генерує команду ADD або SUB.
    Побічний ефект: змінює список code та список tokens
    (видаляє розглянуті токени)
    :param code: список команд - кортежів (<код_команди>, <операнд>)
    :param tokens: список токенів
    :return: None
    """
    _term(code, tokens)
    while tokens:
        if tokens[0][1] == '+':
            code.append((COMMANDS[2],None))
            tokens = tokens[1:]
        elif tokens[0][1] == '-':
            code.append((COMMANDS[3], None))
            tokens = tokens[1:]


def _term(code, tokens):
    """
    Функція генерує код за списком токенів, що починається токенами доданку.
    Використовує функцію _factor для генерації коду множника, після чого,
    поки список токенів не спорожніє і поточний токен - це операція
    '*' або '/', знову використовує _factor для наступного множника та
    генерує команду MUL або DIV.
    Побічний ефект: змінює список code та список tokens
    (видаляє розглянуті токени)
    :param code: список команд - кортежів (<код_команди>, <операнд>)
    :param tokens: список токенів
    :return: None
    """
    _factor(code,tokens)
    while tokens:
        if tokens[0][1] == '*':
            code.append((COMMANDS[4],None))
            tokens = tokens[1:]
            break
        elif tokens[0][1] == '/':
            code.append((COMMANDS[5],None))
            tokens = tokens[1:]
            break


def _factor(code, tokens):
    """
    Функція генерує код за списком токенів, що починається токенами множника.
    Якщо перший токен - "left_paren", то множник - це вираз у дужках і треба
    викликати функцію _expression, після чого пропустити праву дужку.
    Якщо перший токен - константа або змінна, то треба згенерувати команду
    LOADC (додатково - перетворити константу з рядка у дійсне число) або
    LOADV (додатково - додати змінну до пам'яті, якщо необхідно).
    Побічний ефект: змінює список code та список tokens
    (видаляє розглянуті токени)
    :param code: список команд - кортежів (<код_команди>, <операнд>)
    :param tokens: список токенів
    :return: None
    """
    while tokens:
        if tokens[0][0] == "constant":
            code.append((COMMANDS[0], float(tokens[0][1])))
            tokens = tokens[1:]
            break
        if tokens[0][0] == "variable":
            code.append((COMMANDS[1],tokens[0][1]))
            tokens = tokens[1:]
            break
        if tokens[0][1] == "(":
            for i in range(len(tokens)):
                if tokens[i][1] == ")":
                    _expression(code,tokens[1:i])
                    if len(tokens) == i:
                        tokens = []
                    else:
                        tokens = tokens[i+1:]


if __name__ == "__main__":
    code, error = generate_code(["a = b + c", "y = (2 - 1"])
    success = error == "Неправильно розставлені дужки"

    code, error = generate_code(["x = 1",
                                 "z = (((a)))",
                                 "a = b + c * (d - e)",
                                 "y = (2 - 1) * (x345 + 3 * d) / 234.5 - z"])
    success = success and not error and \
        code == [('LOADC', 1.0),
                 ('SET', 'x'),
                 ('LOADV', 'a'),
                 ('SET', 'z'),
                 ('LOADV', 'b'),
                 ('LOADV', 'c'),
                 ('LOADV', 'd'),
                 ('LOADV', 'e'),
                 ('SUB', None),
                 ('MUL', None),
                 ('ADD', None),
                 ('SET', 'a'),
                 ('LOADC', 2.0),
                 ('LOADC', 1.0),
                 ('SUB', None),
                 ('LOADV', 'x345'),
                 ('LOADC', 3.0),
                 ('LOADV', 'd'),
                 ('MUL', None),
                 ('ADD', None),
                 ('MUL', None),
                 ('LOADC', 234.5),
                 ('DIV', None),
                 ('LOADV', 'z'),
                 ('SUB', None),
                 ('SET', 'y')]

    success = success and storage.is_in('a')
    success = success and storage.is_in('x')

    print("Success =", success)
